In [43]:
import pandas as pd
import numpy as np

In [11]:
apples = pd.Series([1,2,3,4,5])
mangos = pd.Series([5,6,7,8])

data= {"apples":apples,"mangos":mangos}

data=pd.DataFrame(data)
print(data)

   apples  mangos
0       1     5.0
1       2     6.0
2       3     7.0
3       4     8.0
4       5     NaN

In [8]:
a = pd.Series([1,2,3,4],index=[4,3,2,1])
b = pd.Series([5,6,7,8],index=[1,2,3,4])

data= {"apples":a,"mangos":b}
#print(data)
data=pd.DataFrame(data)
print(data)

   apples  mangos
1       4       5
2       3       6
3       2       7
4       1       8

In [10]:
a1 = pd.Series([1,2,3,4],index=[4,3,7,8])
b1 = pd.Series([5,6,7,8],index=[1,2,3,4])

data= {"apples":a1,"mangos":b1}
#print(data)
data=pd.DataFrame(data)
print(data)

   apples  mangos
1     NaN     5.0
2     NaN     6.0
3     2.0     7.0
4     1.0     8.0
7     3.0     NaN
8     4.0     NaN

In [13]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
state_pop_df = pd.DataFrame(data 
                     , index = ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'] )
print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [16]:
state_pop_df =pd.DataFrame(data, columns=['year', 'state', 'pop'])
print(state_pop_df.head())
print(state_pop_df.head(3))

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
   year state  pop
0  2000  Ohio  1.5
1  2001  Ohio  1.7
2  2002  Ohio  3.6

In [17]:
state_pop_df =pd.DataFrame(data, columns=['year', 'state', 'pop'])
print(state_pop_df.tail())
state_pop_df.tail(3)

   year   state  pop
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
obj1 = pd.DataFrame(data,columns=['year', 'state', 'pop',1,2])
print(obj1)
print(obj1.columns)
print(obj1.index)

   year   state  pop    1    2
0  2000    Ohio  1.5  NaN  NaN
1  2001    Ohio  1.7  NaN  NaN
2  2002    Ohio  3.6  NaN  NaN
3  2001  Nevada  2.4  NaN  NaN
4  2002  Nevada  2.9  NaN  NaN
5  2003  Nevada  3.2  NaN  NaN
Index(['year', 'state', 'pop', 1, 2], dtype='object')
RangeIndex(start=0, stop=6, step=1)

In [31]:
print(obj1["state"])
print(obj1.state)

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [32]:
obj1.loc[1]

year     2001
state    Ohio
pop       1.7
1         NaN
2         NaN
Name: 1, dtype: object

In [37]:
data2 = {1: state ,
        2 : [2000, 2001, 2002, 2001, 2002, 2003],
        3  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
obj2=pd.DataFrame(data2)
print(obj2)

        1     2    3
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
print(obj2.loc[2])
print(obj2.iloc[2])

1    Ohio
2    2002
3     3.6
Name: 2, dtype: object
1    Ohio
2    2002
3     3.6
Name: 2, dtype: object

In [44]:
obj3=pd.DataFrame(data)
print(obj3)
ln = len(obj3) # finding now of rows in dataframe
#print(frame2)
rng = np.arange(ln)
print(rng)
obj3['debt'] = rng
obj3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
[0 1 2 3 4 5]

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [45]:
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2])
obj3['debt']=val
obj3

    state  year  pop  debt
0    Ohio  2000  1.5  -1.2
1    Ohio  2001  1.7  -1.5
2    Ohio  2002  3.6  -1.7
3  Nevada  2001  2.4  -1.2
4  Nevada  2002  2.9  -1.5
5  Nevada  2003  3.2  -1.7

In [57]:
#both reindex wilnot run twice on the same data,the first one will be applied only,,,try by removing comments

obj4 = pd.Series(['blue', 'purple', 'yellow'], index=[2, 3, 6])
print( obj4 )
#obj4=obj4.reindex(range(9))
#print()
#print(obj4)
obj4=obj4.reindex(range(9),method='ffill')
print()
print(obj4)

2      blue
3    purple
6    yellow
dtype: object

0       NaN
1       NaN
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [70]:
obj5 = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

print(obj5)
# for your own working, run following statement without ffill
#obj5 = obj5.reindex(['a', 'b', 'c', 'd'])

#print(obj5) 

obj5 = obj5.reindex(['a', 'b', 'c', 'd'],method = 'ffill')

print(obj5)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [80]:

print(obj5)
states_name = ['Texas', 'Utah', 'California','Ohio']
obj5 =obj5.reindex(columns=states_name)
print(obj5)
obj5.drop('Utah',axis=1,inplace=True)
print(obj5)
obj5.drop('a',inplace=True)
print(obj5)

   Texas  California  Ohio
a      1           2     0
b      1           2     0
c      4           5     3
d      7           8     6
   Texas  Utah  California  Ohio
a      1   NaN           2     0
b      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6
   Texas  California  Ohio
a      1           2     0
b      1           2     0
c      4           5     3
d      7           8     6
   Texas  California  Ohio
b      1           2     0
c      4           5     3
d      7           8     6

In [88]:
obj6 = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
print(obj6)
print()
print(obj6.one[2:])
print()
print( obj6.iloc[2, [3, 0, 1] ] ) # using number instead of labels
print()
print( obj6.iloc[:])
print()
print ( obj6.iloc[ :3 , :3 ] )
print()
print( obj6.iloc[:, :3])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Utah         8
New York    12
Name: one, dtype: int32

four    11
one      8
two      9
Name: Utah, dtype: int32

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [90]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print(df2)
print()
# applying plus operation between two data frames
df3 = df1 + df2
print(df3)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN